Repository: Freetz-NG/speed-to-fritz
Catalog: trunk/uploader/source/ftp_uploader/upload.*.resx
Languages: de

# Start.Text
source: Start Upload
de: Übertragung starten

# PBox.Text
source: Upload Progress
de: Überragungsfortschritt

# PBox0.Text
source: Erase Progress
de: Löschfortschritt

# checkBox1.Text
source: Clear mtd3/4
de: mtd3/4 löschen

# checkBox2.Text
source: Upload Firmware
de: Firmware übertragen

# Fsel.Text
source: Select Firmware
de: Firmware auswählen

# openFileDialog1.Title
source: Select Firmware
de: Firmware auswählen

# labelGW.Text
source: 1. Switsh Router on and connect PC and Router with a Patch, better would be to put a HUB between PC and Router 2. Set up static PC LAN: IP:192.168.178.2 Mask: 255.255.0.0 3. Disable all other Devices that use IP Addresses on the PC 4. Disable Firewall 5. Click Start Upload
de: 1. Router einschalten und PC und Router mit einen Patch-Kabel verbinden, besser ist es einen HUB oder Switch dazwischen zu schalten. 2. Statische Einträge beim PC LAN: IP:192.168.178.2 Maske: 255.255.0.0 3. Deaktiviren sie alle anderen Geräte am PC die IP Adressen benutzen 4. Deaktivieren Sie die Firewall 5. Klicken Sie 'Übertragung starten'

# testText.Text
source: --> Switch Router Power Line Off And On Again, then Click 'OK' Button Within Three Seconds. --> If it did not work the first time wait until this Popup comes up again and repeat. Attention: Static PC LAN IP settings are needed. IP:
de: --> Router Stromversorgung Aus und Einschalten anschließend innerhal drei Sekunden 'OK' betätigen. --> Sollte es das erste mal nicht funktioniert haben, erneut warten bis dieses Fenster erscheint ( Kann mehrmals wiederholt werden). Achtung: Das PC LAN braucht statische IP Einstellungen:

# labelLooking.Text
source: Looking for Router on IP:
de: Suche Router mit IP:

# labelSwitch.Text
source: , Switch Router OFF and On again!
de: , Router wieder AUS und EIN schalten!

# labelStartWait.Text
source: --> Start --> Wait for response ...
de: --> Start --> Warte auf eine Antwort vom Router ...

# labelNoPW.Text
source: No password has been set.
de: Es wurde kein Passwort gesetzt.

# labelErase.Text
source: Erase
de: Lösche

# labelErasemtd1.Text
source: Erase Flash mtd1 partition, please wait up to three minutes...
de: Lösche Flash Partition mtd1, bitte warte, es kann bis zu drei Minuten dauern ...

# labelErrorServer.Text
source: Error: Must be connected to a server.
de: Fehler: Es besteht keinen Verbindung.

# labelSecElapsed.Text
source: sec elapsed
de: sec verstrichen

# labelOf.Text
source: of
de: von

# labelUploadmtd1.Text
source: Upload kernel.image to mtd1:
de: Übertrage kernel.image nach mtd1:

# labelKInotfound.Text
source: File kernel.image not found! Select a Firmware first. 'kernel.image' file can be extracted from every AVM Firmware. Rename Firmware to any name with extension 'tar', untar and look into the subdirectory \tmp for kernel.image
de: Die Datei kernel.image fehlt! Wählen Sie voher eine Firmware oder ein kernel.image aus.

# labelFreetzPackages.Text
source: Firmware is a Freetz Firmware with the following Packages:
de: Diese Firmware ist eine Freetz Firmware mit den folgenden Packeten:

# labelLogWrittenTo.Text
source: Log written to:
de: Ereignisses gespeichert in:

# buttonSP.Text
source: Deutsch
de: English

# $this.Text
source: Firmware Uploader V1.1
de: Firmware Lader V1.1
